public class Main {
    //  Многопоточность
    /*
    Многозадачность бывает двух типов:
    process-based , т.е. когда есть несколько одновременно работающих
    процессов (программ)
    thread-based  - когда одна программа выполняется в нескольких потоках

    Поток может находиться в нескольких состояниях :
    1. running -  рабочее состояние, работает
    2. ready to run -  готов приступить к работе как только получит доступ к процессору(процессорное время)
    3. suspended - работающий поток может быть временно приостановлен
    4. blocked -  когда поток не может получить доступ к требуемому ресурсу
    5. termintated - выполнение прекращается  и не может быть возобновлено

    В многопоточности очень важным является вопрос синхронизации. Синхронизация позволяет
    координировать работу потоков определенным продуманным образом.
     */
}
