public class Main {
    public static void main(String[] args) {
        //Comparator Interface  Интерфейс Компаратор

     /*
        Интерфейс Comparator  прдоставляет классам , реализующим его возможности
        лополнительной сортировки по другим критериям, отличным от т.н. сортировки в естественном
        порядке.
        Этот Интерфейс находится в пакете java.util  и имеет единственный метод compare().

        public interface Comparator<T>{

            public int compare( T o1, T o2);

       Метод compare принимает 2 обьекта и сравнивает их следующим образом:
       - результат сравнения отрицательное число если первый обьект меньше второго
       -ноль если они равны
       - положительное число если первый обьект больше
        }
      */
    }
}
