public class Main {
    public static void main(String[] args) {
        // Юнит Тестирование

        /*
        Тестирование - это когда один программный код запускает другой с целью проверки
        функционирования его в соответствии с ожиданиями.

        Виды тестирования:

        unit тестирование - тестирование отдельных методов
        integration test  -(интеграционные тесты) -проверяется работает ли вся система или
                           какой-то ее компонент в соответствии с ожиданиями
        performance test - проверка эффективности  работы системы при высокой нагрузке

        Тестовый класс принято называть по имени тестируемого класса с прибавлением в конце слова Test.
        т.е. например для класса Employee -> EmployeeTest

        варианты названий тестовых методов :
        -orderShouldBeCreated menuShouldGetActive
        -givenOdinDvaWhenPlusThenResult5

        В Джаве для юнит тестирования часто используется библиотека JUnit 5

        Аннотации в JUnit5:

        - Метод, имеющий аннотацию @BeforeEach  выполняется перед каждым тестом
        - Аннотация @DisplayName может использоваться для определения имени теста.
        - Метод, аннотированный @Test  является тестовым методом
        - AssertEquals()- проверяет равенство ожидаемого и фактического значений. Если они не равны,
        то тест не проходит (test failed) и сообщение об ошибки
        //








         */
    }
}
