public class Main {

    //Java packages
    /*
    1- Built-in  стандартные, уже написанные и доступные всем классам пакеты
    Java API
    java.lang - содержит большое количество классов общего назначения
    java.io -классы отвечающие за ввод-вывод
    java.net - классы , поддерживающие сетевые вопросы
    java.util - содержит большое количество классов-утилит

    2- пакеты, которые создает пользователь.
    обращение к подпакету происходит перечислением имен пакетов через точку
    java_packages.subpackage
     */

    public static void main(String[] args) {
        int[] ints = new int[10];
        ints[0]=2;

    }
}
