public class Main {
    // методы wait и notify
  /*
    метод wait() -  нужен для того чтобы приостановить поток
    notify() - нужен чтобы вновь запустить приостановленный  поток ("разбудить")
    notifyAll()

    wait() - ждет пока он не будет "разбужен" с помощью notify или notifyAll
    wait(long time)-поток проснется автоматически по истечении заданного
    времени time  если до этого его не разбудит метод notify

    notify() -  уведомляет об освобождении монитора один из потоков
    notifzAll()- будит все потоки, ожидающие доступ к монитору обьекта
   */
}
